ThisIsSzimon/STM32-Time-Frequency-Analysis/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "spi.h"
#include "stm32f4xx_hal_tim.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "adxl.h"
#include <stdint.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define RPM_MAX 12000
#define RPM_MIN 1000
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
ADXL_Handle adxl = {
  .hspi    = &hspi2,
  .cs_port = SPI2_CS_GPIO_Port,
  .cs_pin  = SPI2_CS_Pin,
};
volatile uint32_t rpm = 0;
volatile uint8_t rpm_valid = 0;
volatile uint32_t last_pulse_ms = 0; 
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

#define FIFO_CHUNK 16

static int16_t fifo_buf[FIFO_CHUNK * 3];
static uint32_t sample_id = 0;

static void send_fifo_bin_batch(uint32_t start_id, const int16_t *buf_xyz, uint8_t n)
{
  if (n == 0 || n > 16) return;

  uint16_t frame_len = (uint16_t)(8 + 6 * n);
  uint8_t frame[8 + 6*16];  // max 104 B

  frame[0] = 0xAA; frame[1] = 0x55;
  frame[2] = n;

  frame[3] = (uint8_t)( start_id        & 0xFF);
  frame[4] = (uint8_t)((start_id >> 8)  & 0xFF);
  frame[5] = (uint8_t)((start_id >> 16) & 0xFF);
  frame[6] = (uint8_t)((start_id >> 24) & 0xFF);

  uint16_t w = 7;
  for (uint8_t i = 0; i < n; ++i) {
    int16_t x = buf_xyz[3*i + 0];
    int16_t y = buf_xyz[3*i + 1];
    int16_t z = buf_xyz[3*i + 2];
    frame[w++] = (uint8_t)(x & 0xFF); frame[w++] = (uint8_t)((uint16_t)x >> 8);
    frame[w++] = (uint8_t)(y & 0xFF); frame[w++] = (uint8_t)((uint16_t)y >> 8);
    frame[w++] = (uint8_t)(z & 0xFF); frame[w++] = (uint8_t)((uint16_t)z >> 8);
  }

  uint8_t sum = 0;
  for (uint16_t i = 2; i < frame_len - 1; ++i) sum = (uint8_t)(sum + frame[i]);
  frame[frame_len - 1] = sum;

  HAL_UART_Transmit(&huart2, frame, frame_len, HAL_MAX_DELAY);
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI2_Init();
  MX_USART2_UART_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_Base_Start(&htim2);
  HAL_GPIO_WritePin(SPI2_CS_GPIO_Port, SPI2_CS_Pin, GPIO_PIN_SET);
  if (!ADXL_Init(&adxl, ADXL_ODR_1600HZ, ADXL_RANGE_8G, true)) {
    Error_Handler();
  }
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    
    int n = ADXL_FifoReadSamples(&adxl, fifo_buf, FIFO_CHUNK);
    if (n > 0) {
      uint32_t start_id = sample_id;
      sample_id += (uint32_t)n;
      send_fifo_bin_batch(start_id, fifo_buf, (uint8_t)n);
    }
    
    uint32_t now_ms = HAL_GetTick();
    uint32_t timeout_ms = 2 * (60000UL / RPM_MIN); // 2 okresy [ms]
    if (rpm_valid && (now_ms - last_pulse_ms > timeout_ms)) {
      rpm_valid = 0;
      rpm = 0;
    }
    static uint32_t last_report = 0;
    if (now_ms - last_report >= 200) {
      last_report = now_ms;

      char msg[32];
      uint32_t rpm_snapshot = rpm; // atomowy odczyt (32 bity na F4 jest OK)

      int len = snprintf(msg, sizeof(msg), "RPM:%lu\r\n", (unsigned long)rpm_snapshot);
      HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, HAL_MAX_DELAY);
    }
       
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if (GPIO_Pin == GPIO_PIN_0)
  {
    static uint32_t last = 0;

    uint32_t now = __HAL_TIM_GET_COUNTER(&htim2);
    uint32_t dt = now - last;           // liczy poprawnie także po overflow
    last = now;

    uint32_t dt_min = 60000000UL / RPM_MAX; // ~5000 us
    uint32_t dt_max = 60000000UL / RPM_MIN; // ~600000 us

    if (dt > dt_min && dt < dt_max)  // luzny zakres zabezpieczający
    {
      uint32_t new_rpm = 60000000UL / dt;
      rpm = new_rpm;
      rpm_valid = 1;
      last_pulse_ms = HAL_GetTick();
    }
    else
    {

    }
  }
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
